#+TITLE: Answers to DM1 Week 01 EPPs
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t d:(not "HINT")
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

  These are sample/examplary answers, some of which come from former students.

** UCG
#+begin_info
  1. =[vim verve butter vinegar pepper vigor]=
  2. =[vigor]=
  3. =[vim verve vinegar vigor]=
  4. =[butter vinegar pepper vigor]=
  5. =[vinegar vigor]=
  6. \emptyset

#+BEGIN_SRC emacs-lisp
  (setq A [verve vim vigor]
        B [butter vinegar pepper vigor]
        set1 (apply 'vector (union (append A nil) (append B nil)))
        set2 (apply 'vector (intersection (append A nil) (append B nil)))
        partial-answer (list (list 1 set1) (list 2 set2)))
#+END_SRC

#+RESULTS:
| 1 | [vim verve butter vinegar pepper vigor] |
| 2 | [vigor]                                 |
#+end_info
** OYW
#+begin_info
#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-or-q [p or q]))
    (prop-eval p-or-q))
#+END_SRC

#+RESULTS:
([It is raining] (nil) or [The grass is wet] (nil) yields nil)
([It is raining] (nil) or [The grass is wet] (t) yields t)
([It is raining] (t) or [The grass is wet] (nil) yields t)
([It is raining] (t) or [The grass is wet] (t) yields t)

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-xor-q [p xor q]))
    (prop-eval p-xor-q))
#+END_SRC

#+RESULTS:
([It is raining] (nil) xor [The grass is wet] (nil) yields nil)
([It is raining] (nil) xor [The grass is wet] (t) yields t)
([It is raining] (t) xor [The grass is wet] (nil) yields t)
([It is raining] (t) xor [The grass is wet] (t) yields nil)

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-if-and-only-if-q [p <--> q]))
    (prop-eval p-if-and-only-if-q))
#+END_SRC

#+RESULTS:
([It is raining] (nil) <--> [The grass is wet] (nil) yields t)
([It is raining] (nil) <--> [The grass is wet] (t) yields nil)
([It is raining] (t) <--> [The grass is wet] (nil) yields nil)
([It is raining] (t) <--> [The grass is wet] (t) yields t)
#+end_info
** OUB
#+begin_info
#+BEGIN_SRC emacs-lisp :results silent
  (defun <-- (p q)
    "Reverse conditional: q only if p"
    (or (not q) p))
#+END_SRC

  Two shorter ways to correctly implement =<-->=:

#+BEGIN_SRC emacs-lisp :results silent
  (defun <-xor-> (p q)
    "Biconditional: p if and only if q"
    (not (xor p q)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results silent
  (defun <-eq-> (p q)
    "Biconditional: p if and only if q"
    (eq p q))
#+END_SRC

  Four quick tests:
#+BEGIN_SRC emacs-lisp
  (list (list 'p 'q "p <--> q" "p <-xor-> q" "p <-eq-> q")
        (list  nil nil (<--> nil nil) (<-xor-> nil nil) (<-eq-> nil nil))
        (list  nil  t  (<--> nil  t ) (<-xor-> nil  t ) (<-eq-> nil  t ))
        (list   t  nil (<-->  t  nil) (<-xor->  t  nil) (<-eq->  t  nil))
        (list   t   t  (<-->  t   t ) (<-xor->  t   t ) (<-eq->  t   t )))
#+END_SRC

#+RESULTS:
| p   | q   | p <--> q | p <-xor-> q | p <-eq-> q |
| nil | nil | t        | t           | t          |
| nil | t   | nil      | nil         | nil        |
| t   | nil | nil      | nil         | nil        |
| t   | t   | t        | t           | t          |
#+end_info
** UQY
#+begin_info
#+BEGIN_SRC emacs-lisp :results silent
  (defun not1 (x)
    (- 1 x))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (list (list 'x "(not1 x)" "(not (not (zerop x)))")
        (list  0 (not1 0) (not (not (zerop 0))))
        (list  1 (not1 1) (not (not (zerop 1)))))
#+END_SRC

#+RESULTS:
| x | (not1 x) | (not (not (zerop x))) |
| 0 |        1 | t                     |
| 1 |        0 | nil                   |

#+BEGIN_SRC emacs-lisp :results silent
  (defun and2 (x y)
    (* x y))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (list (list 'x 'y "(and2 x y)" "(and (not (zerop x)) (not (zerop y)))")
        (list  0  0  (and2 0 0)   (and (not (zerop 0)) (not (zerop 0))))
        (list  0  1  (and2 0 1)   (and (not (zerop 0)) (not (zerop 1))))
        (list  1  0  (and2 1 0)   (and (not (zerop 1)) (not (zerop 0))))
        (list  1  1  (and2 1 1)   (and (not (zerop 1)) (not (zerop 1)))))
#+END_SRC

#+RESULTS:
| x | y | (and2 x y) | (and (not (zerop x)) (not (zerop y))) |
| 0 | 0 |          0 | nil                                   |
| 0 | 1 |          0 | nil                                   |
| 1 | 0 |          0 | nil                                   |
| 1 | 1 |          1 | t                                     |

#+BEGIN_SRC emacs-lisp :results silent
  (defun or2 (x y)
    (- (+ x y) (* x y)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (list (list 'x 'y "(or2 x y)" "(or (not (zerop x)) (not (zerop y)))")
        (list  0  0  (or2 0 0)   (or (not (zerop 0)) (not (zerop 0))))
        (list  0  1  (or2 0 1)   (or (not (zerop 0)) (not (zerop 1))))
        (list  1  0  (or2 1 0)   (or (not (zerop 1)) (not (zerop 0))))
        (list  1  1  (or2 1 1)   (or (not (zerop 1)) (not (zerop 1)))))
#+END_SRC

#+RESULTS:
| x | y | (or2 x y) | (or (not (zerop x)) (not (zerop y))) |
| 0 | 0 |         0 | nil                                  |
| 0 | 1 |         1 | t                                    |
| 1 | 0 |         1 | t                                    |
| 1 | 1 |         1 | t                                    |

 The other tests (in the book) work too.
#+end_info
** UFZ
#+begin_info
  Variants of p \rarr q (the \ldquo{}straight\rdquo conditional):
  - converse :: q \rarr p (swap left and right sides)
  - inverse :: \not p \rarr \not q (negate both sides)
  - contrapositive :: \not q \rarr \not p (form the inverse of the converse)
#+BEGIN_SRC emacs-lisp
  (defun --> (p q)
    "straight conditional"
    (or (not p) q))

  (defun converse (p q)
    "swaps p and q"
    (--> q p))

  (defun inverse (p q)
    "negates p and q"
    (--> (not p) (not q)))

  (defun contrapositive (p q)
    "swaps and negates p and q"
    (--> (not q) (not p)))

  (setq it-is-raining t
        the-grass-is-wet nil
        results (mapcar 'list (list
                 (--> it-is-raining the-grass-is-wet)
                 (inverse it-is-raining the-grass-is-wet)
                 (converse it-is-raining the-grass-is-wet)
                 (contrapositive it-is-raining the-grass-is-wet))))
#+END_SRC

#+RESULTS:
| nil |
| t   |
| t   |
| nil |
#+end_info
